{
  "id": "pc-010",
  "topic_id": "ratio-proportion",
  "name": {
    "en": "Ratio Reversal with Constant Product",
    "hi": "नियत गुणनफल के साथ अनुपात उलट"
  },
  "embedding_text": "Ratio Reversal with Constant Product in percentage problems where reversing ratios helps find unknowns.",
  "trick": {
    "name": "Reverse Ratio Trick",
    "hinglish_description": "Jab bhi ratio diya ho aur product constant ho, ratio ko ulta karke unknown values nikaalo. Ye trick SSC exams mein jaldi answer dene ke liye kaam aati hai."
  },
  "steps": [
    {
      "step": "Identify the given ratio and calculate the total parts.",
      "example": "Males (M) = 7, Females (F) = 5, Total parts = 7 + 5 = 12"
    },
    {
      "step": "Calculate the actual number of parts using the total population.",
      "example": "7/12 of 12960 = 7560 males"
    },
    {
      "step": "Use the percentage given to find the number of married individuals.",
      "example": "45% of 7560 = 3402 males married"
    },
    {
      "step": "Reverse the ratio for the other group and calculate.",
      "example": "Reverse ratio for married females = 5:7"
    },
    {
      "step": "Calculate the percentage of the other group using the reversed ratio.",
      "example": "Calculate percentage: (3402 / (5/12 * 12960)) * 100 = 63%"
    }
  ],
  "common_mistakes": [
    "Not reversing the ratio correctly.",
    "Forgetting to convert fractions to percentages.",
    "Miscalculating the total number of parts."
  ],
  "teaching_content": {
    "deep": "Is pattern ko samajhne ke liye, pehle ratio aur proportion ka concept clear hona chahiye. Phir, ratio reversal kaise kaam karta hai, isko step-by-step samjho. Har step pe dhyan do, jaise ki ratio ko ulta karna aur percentage calculate karna.",
    "shortcut": "Jab bhi ratio aur constant product mile, ratio ko ulta karke doosre group ka percentage nikaalo. Ye trick jaldi answer dene mein madad karti hai.",
    "instant": "Ratio ko ulta karo aur percentage nikaalo. Ye SSC exams mein time bachata hai."
  },
  "tags": [
    "percentage",
    "ratio reversal",
    "constant product",
    "SSC shortcut",
    "mathematical tricks"
  ]
}