{
  "id": "pc-011",
  "topic_id": "percentage",
  "name": {
    "en": "Income Tax Increase - Net Income Decrease",
    "hi": "आयकर वृद्धि - शुद्ध आय में कमी"
  },
  "embedding_text": "Understanding how an increase in income tax affects net income using percentage calculations.",
  "trick": {
    "hinglish": "Agar income tax badh jaaye, toh net income kaise kam hoti hai, yeh hum percentage se jaldi se nikal sakte hain. Pehle total income nikal lo aur phir naye percentage se multiply karke nayi net income pata kar lo."
  },
  "steps": [
    {
      "description": "Step-by-step trick application",
      "examples": [
        {
          "step": "Pehle current income tax percentage ko samjho: 8 paise matlab 8%.",
          "calculation": "Income tax at 8 paise per rupee = 8%"
        },
        {
          "step": "Net income ko total income ka percentage samjho: 92%.",
          "calculation": "Net income = 92% of total income"
        },
        {
          "step": "Given net income se total income nikal lo.",
          "calculation": "Total income = 309580 / 0.92"
        },
        {
          "step": "Naye income tax percentage ko samjho: 12 paise matlab 12%.",
          "calculation": "Income tax at 12 paise per rupee = 12%"
        },
        {
          "step": "Naye net income percentage se nayi net income calculate karo.",
          "calculation": "New net income = (total income) * 0.88"
        },
        {
          "step": "Final answer: Nayi net income.",
          "calculation": "New net income = 286611"
        }
      ]
    }
  ],
  "common_mistakes": [
    "Income tax percentage ko galat samajhna, jaise 8 paise ko 0.08% samajhna.",
    "Net income ko directly new percentage se multiply kar dena bina total income nikaale.",
    "Calculation mein rounding errors karna."
  ],
  "teaching_content": {
    "deep": "Is pattern ko samajhne ke liye, pehle income tax aur net income ke beech ka relation samjho. Income tax badhne par net income kaise kam hoti hai, yeh percentage se kaise nikalte hain, isko detail mein samjho. Pehle total income nikalte hain, phir naye percentage se net income calculate karte hain.",
    "shortcut": "Income tax badhne par net income kaise kam hoti hai, yeh jaldi se nikalne ke liye pehle total income nikal lo aur phir naye percentage se multiply kar do.",
    "instant": "Total income nikal lo aur naye percentage se multiply karke nayi net income pata kar lo."
  },
  "tags": [
    "income tax",
    "net income",
    "percentage",
    "calculation",
    "shortcut",
    "SSC exam"
  ]
}